ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f2838x_clb_data_exchange_regs.xml
<module id="CLB_DATA_EXCHANGE_REGS" HW_revision="" description="CLB DATA EXCHANGE Registers">
	<register id="CLB_PUSH" width="32" page="1" offset="0x0" internal="0" description="CLB_PUSH FIFO Registers (from HLC)">
		<bitfield id="PUSH" description="FIFO TO System From CLB" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CLB_PULL" width="32" page="1" offset="0x40" internal="0" description="CLB_PULL FIFO Registers (TO HLC)">
		<bitfield id="PULL" description="FIFO From system TO CLB" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
